//УСЛОВИЕ (PROBLEM)
/*Число в интервалa
Да се напише програма, която проверява дали въведеното от потребителя число е в интервала [-100, 100] и е
различно от 0 и извежда "Yes", ако отговаря на условията, или "No" ако е извън тях.
Проверете дали числото е в интервала [-100, 100] и е различно от 0, и ако проверката върне "true",
отпечатайте на конзолата "Yes" в противен случай, отпечатайте "No". */

function numberInRange(input) {
    let num = Number(input.shift());

    if ((-100 <= num && num <= 100) && num !== 0) {
        console.log("Yes");

    }else {
        console.log("No");
    }
}

numberInRange(["-25"]);
numberInRange(["0"]);
numberInRange(["25"]);