//УСЛОВИЕ (PROBLEM):
/*Щанд за лимонада
Ани решила да спести пари за лятната си почивка като продава лимонада. За направата на лимонадата се
използват определено количество лимони, захар и вода, като се знае че от един килограм лимони стават
980 мл. лимонов сок, а след разтварянето на захарта във водата и сока, сместа се увеличава с 30% от теглото
на захарта. След като направи лимонадата, Ани я продава в чаши от по 150 мл. Напишете програма, която
изчислява колко чаши с лимонада е продала Ани и каква е нейната печалба, като имате предвид, че цената
за една чаша е 1.20 лв.
ЗАБЕЛЕЖКА: При изчисляването на броя на чашите да се закръгли към по-малкото цяло число.
Вход
От конзолата се четат 3 реда:
• Първи ред – килограмите лимони. Реално число в интервала [1.00…1000.00]
• Втори ред – килограмите захар. Реално число в интервала [1.00…100.00]
• Трети ред – литрите вода. Реално число в интервала [1.00…1000.00]
Изход
На конзолата се отпечатват два реда:
• "All cups sold: {броят на продадените чаши с лимонада}"
• "Money earned: {спечелената сума}"
Сумата да се форматира до втората цифра след десетичния знак.
 */

 function lemonadeStand(input) {
    let lemonsKg = Number(input.shift());
    let sugarKg = Number(input.shift());
    let waterLiters = Number(input.shift());

    let lemonJuice = lemonsKg*980;
    let sugarTotal = sugarKg * 0.30;
    let waterMililiters = waterLiters*1000;

    let juiceLiters = lemonJuice + sugarTotal + waterMililiters;

    let cupsNumber = Math.floor((juiceLiters / 150));
    let juiceProfit = (cupsNumber * 1.20).toFixed(2);

    console.log(`All cups sold: ${cupsNumber}`);
    console.log(`Money earned: ${juiceProfit}`);
 }

lemonadeStand(["5", "3.5", "5"]);
lemonadeStand(["250", "20", "100"]);
lemonadeStand(["85", "17.5", "35"]);