//УСЛОВИЕ (PROBLEM):
/*Деси иска да посети голям музикален фестивал това лято. Тя трябва да започне да спестява част от дохода си,
за да успее да заплати разходите по пътуването й до там. Напишете програма, която да изчисли максимално
колко процента от дохода си може да спестява Деси, за да посети фестивала. Всеки месец, Деси има нужда от
определена сума пари, за да покрие личните си разходи за месеца, а 30% от дохода си ще запази за
непредвидени разходи.
Вход
От конзолата се четат 3 числа:
1. Първи ред – дохода на Деси за месец – реално число в интервала [1500.00… 10 000.00]
2. Втори ред – броят месеци, с които Деси разполага, за да спести парите – цяло число в интервала
[3... 12]
3. Трети ред – сумата, от която Деси има нужда, за да покрие личните си разходи – реално число
в интервала [300.00... 1000.00]
Изход
На конзолата да се отпечатат два реда:
• "She can save {максимален процент от дохода си, който може да спести}%"
• "{сумата, която ще успее да спести}"
Всички числа трябва да бъдат форматирани до втората цифра след десетичния знак */

function savings(input) {
    let income = Number(input.shift());
    let monthsNumber = parseInt(Number(input.shift()));
    let personalExpenses = Number(input.shift());

    let savedMoney = (income - (personalExpenses+(income*0.30)));
    let totalSavedMoney = savedMoney*monthsNumber;

    let percentMoneySaved = (savedMoney/income) * 100;

    console.log(`She can save ${percentMoneySaved.toFixed(2)}%`);
    console.log(`${totalSavedMoney.toFixed(2)}`);
}

savings(["1500", "3", "800"]);
savings(["2050", "5", "900"]);