//УСЛОВИЕ (PROBLEM):
/*Благотворителна кампания
В сладкарница се провежда благотворителна кампания за събиране на средства, в която могат да се включат
сладкари от цялата страна. Първоначално прочитаме от конзолата броя на дните, в които тече кампанията и
броя на сладкарите, които ще се включат. След това на отделни редове получаваме количеството на
тортите, гофретите и палачинките, които ще бъдат приготвени от един сладкар за един ден. Трябва да се
има предвид следния ценоразпис:
 Торта - 45 лв.
 Гофрета - 5.80 лв.
 Палачинка – 3.20 лв.
1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на
кампанията. Да се напише програма, която изчислява сумата, която е събрана в края на кампанията.
Вход
От конзолата се четат 5 реда:
1. Броят на дните, в които тече кампанията – цяло число в интервала [0 … 365]
2. Броят на сладкарите – цяло число в интервала [0 … 1000]
3. Броят на тортите – цяло число в интервала [0… 2000]
4. Броят на гофретите – цяло число в интервала [0 … 2000]
5. Броят на палачинките – цяло число в интервала [0 … 2000]
Изход
Да се отпечата на конзолата едно число:
 парите, които са събрани, форматирани до втория знак след десетичната запетая. */

function charityCampaign(input) {
    let campaignDayNum = Number(input.shift());
    let confectionersNum = Number(input.shift());
    let cakesNum = Number(input.shift());
    let wafflesNum = Number(input.shift());
    let pancakesNum = Number(input.shift());

    let cakesPrice = cakesNum * 45;
    let wafflesPrice = wafflesNum * 5.80;
    let pancakesPrice = pancakesNum * 3.20;

    let totalPrice = cakesPrice + wafflesPrice + pancakesPrice;
    let totalSum = totalPrice * confectionersNum * campaignDayNum;

    let costs = totalSum / 8;
    let earnings = totalSum - costs;

    console.log(earnings.toFixed(2));
}

charityCampaign(["20", "8", "14", "30", "16"]);
charityCampaign(["131", "5", "9", "33", "46"]);