//УСЛОВИЕ (PROBLEM):
/*Зала за танци
Група танцьори си търсят нова зала. Залата, която са харесали, е правоъгълна и има размери:
L - дължина и W - ширина (в метри). В залата има квадратен гардероб със страна - A и правоъгълна скамейка
с площ 10 пъти по-малка от площта на залата.
Мястото, което заема един танцьор е 40 см² и допълнително за свободно движение му трябват още 7000см².
Напишете програма, която да изчислява колко танцьори могат да се поберат в залата и да се движат
свободно.
Полученият резултат трябва да се закръгли до най-близкото цяло число надолу.
Вход
От конзолата се четат 3 реда:
1. L – дължина на залата в метри – реално число в интервала [10.00 … 100.00]
2. W – ширина на залата в метри – реално число в интервала [10.00 … 100.00]
3. А – страна на гардероба в метри – реално число в интервала [2.00… 20.00]
Изход
Да се отпечата на конзолата едно цяло число – броя танцьори, които могат да се поберат в свободното
пространство на залата, закръглени до най-близкото цяло число надолу. */

function danceHall(input) {
    let hallLength = (Number(input.shift()))*100;
    let hallWidth = (Number(input.shift()))*100;
    let wardrobeSide = (Number(input.shift()))*100;

    let hallArea = hallLength * hallWidth;
    let wadrobeArea = wardrobeSide*wardrobeSide;
    let benchArea = hallArea/10;

    let dancerArea = 40;
    let dancerDancingArea = 7000;

    let freeSpace = hallArea - (wadrobeArea + benchArea);

    let dancersNumber = freeSpace / (dancerArea+dancerDancingArea);

    console.log(Math.floor(dancersNumber));
}

danceHall(["50", "25", "2"]);

