//УСЛОВИЕ (EXAM PROBLEM):
/*За рождения си ден Любомир получил аквариум с формата на паралелепипед.
Първоначално приемаме, като вход размерите му – дължина, широчина и височина в сантиметри.
Трябва да се пресметне, колко литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му
е заета от пясък, растения, нагревател и помпа. 
Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/. 
Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
Вход
От конзолата се приемат 4 числа:
1.	Дължина в см –число в интервала [10 … 500]
2.	Широчина в см –число в интервала [10 … 300]
3.	Височина в см –число в интервала [10… 200]
4.	Процент  –число в интервала [0.000 … 100.000]
Изход
Да се отпечата на конзолата едно число:
•	литрите вода, които ще  събира аквариума, форматирани до третия знак след десетичната запетая.
 */

 function fishTank(input) {
     let length = Number(input.shift());
     let width = Number(input.shift());
     let height = Number(input.shift());
     let percent = Number(input.shift());

     let volume = (length * width * height) *0.001;

     let usedVolume = volume*(percent/100);

     let litersWater = volume-usedVolume;

     console.log(litersWater.toFixed(3));
 }

 fishTank(["85", "75", "47", "17"]);
 fishTank(["105", "77", "89", "18.5"]);
